package come;



public class text {
	public static void main(String[] args) {
		String[] isbn={
				"123456789012345",
				"521254893256250",
				"100021583326589",
				"125852369632154",
				"852315469852154",
				"852159625863258",
				"569854120326587",
				"125489632569874",
				"154785412589635",
				"521254789632547",
				"156325984560321",
				"301254789632569",
				"254823698547112",
				"125632548965890",
				"152365478965478"};
		System.out.println(isbn.length);
		String[] bname={"凉生，我们可不可以不忧伤",
				"谁的流年似若歌",
				"溺水的石头爱情的花",
				"亲爱的，你说你说",
				"流年难掩画中梦",
				"倾尽天下，乱世繁华",
				"左手倒影，右手年华",
				"梦里花落知多少",
				"悲伤逆流成河",
				"年华是无效信",
				"致我们终将逝去的青春",
				"雪语蝶恋",
				"黑天使",
				"支离破碎",
				"盘旋后消失"};
		System.out.println(bname.length);
		String[] bau={
				"张一",
				"李二",
				"王三",
				"毛四",
				"刘五",
				"成六",
				"赵七",
				"孙八",
				"周九",
				"钱十",
				"冯十一",
				"楚十二",
				"陈十三",
				"魏十四",
				"庄十五"
		};
		System.out.println(bau.length);
		String[] bpu={
				"北京大学出版社",
				"华中科技大学出版社",
				"清华大学出版社",
				"机械工业出版社",
				"复旦大学出版社",
				"哈佛大学出版社",
				"耶鲁大学出版社",
				"剑桥大学出版社",
				"新华出版社",
				"科学出版社",
				"中国人民大学出版社",
				"中国商业出版社",
				"国防大学出版社",
				"北京联合出版社",
				"武汉大学出版社",
		};
		System.out.println(bpu.length);
		String[] bpud={
				"2002-01-01",
				"2012-02-22",
				"2013-03-23",
				"2014-04-02",
				"2015-05-01",
				"2016-06-12",
				"2017-07-09",
				"2001-08-06",
				"2012-09-16",
				"1998-10-22",
				"1997-11-30",
				"2000-12-19",
				"2011-11-17",
				"2010-02-31",
				"2011-01-01"
		};
		System.out.println(bpud.length);
		String[] bloc={
				"103室1号书架1层",
				"205室2号书架2层",
				"301室3号书架3层",
				"201室4号书架4层",
				"401室5号书架1层",
				"403室6号书架2层",
				"501室7号书架3层",
				"601室8号书架4层",
				"303室9号书架1层",
				"102室10号书架2层",
				"603室11号书架3层",
				"205室12号书架4层",
				"206室13号书架1层",
				"305室11号书架2层",
				"405室2号书架3层"
		};
		System.out.println(bloc.length);
		for(int i=1;i<=500;i++){
			int index=(int)((Math.random() * bloc.length));
			System.out.println("insert into books (isbn,bname,bau,bpu,bpud,bloc) values('"+isbn[index]+"','"+bname[index]+"','"+bau[index]+"','"+bpu[index]+"','"+bpud[index]+"','"+bloc[index]+"');");
		}
		
	}
}
